hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/rf_noRtos_lib/inc/hw_event.h
/******************************************************************************
*  Filename:       hw_event_h
*  Revised:        2015-11-12 13:07:02 +0100 (Thu, 12 Nov 2015)
*  Revision:       45056
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_EVENT_H__
#define __HW_EVENT_H__

//*****************************************************************************
//
// This section defines the register offsets of
// EVENT component
//
//*****************************************************************************
// Output Selection for CPU Interrupt 0
#define EVENT_O_CPUIRQSEL0                                          0x00000000

// Output Selection for CPU Interrupt 1
#define EVENT_O_CPUIRQSEL1                                          0x00000004

// Output Selection for CPU Interrupt 2
#define EVENT_O_CPUIRQSEL2                                          0x00000008

// Output Selection for CPU Interrupt 3
#define EVENT_O_CPUIRQSEL3                                          0x0000000C

// Output Selection for CPU Interrupt 4
#define EVENT_O_CPUIRQSEL4                                          0x00000010

// Output Selection for CPU Interrupt 5
#define EVENT_O_CPUIRQSEL5                                          0x00000014

// Output Selection for CPU Interrupt 6
#define EVENT_O_CPUIRQSEL6                                          0x00000018

// Output Selection for CPU Interrupt 7
#define EVENT_O_CPUIRQSEL7                                          0x0000001C

// Output Selection for CPU Interrupt 8
#define EVENT_O_CPUIRQSEL8                                          0x00000020

// Output Selection for CPU Interrupt 9
#define EVENT_O_CPUIRQSEL9                                          0x00000024

// Output Selection for CPU Interrupt 10
#define EVENT_O_CPUIRQSEL10                                         0x00000028

// Output Selection for CPU Interrupt 11
#define EVENT_O_CPUIRQSEL11                                         0x0000002C

// Output Selection for CPU Interrupt 12
#define EVENT_O_CPUIRQSEL12                                         0x00000030

// Output Selection for CPU Interrupt 13
#define EVENT_O_CPUIRQSEL13                                         0x00000034

// Output Selection for CPU Interrupt 14
#define EVENT_O_CPUIRQSEL14                                         0x00000038

// Output Selection for CPU Interrupt 15
#define EVENT_O_CPUIRQSEL15                                         0x0000003C

// Output Selection for CPU Interrupt 16
#define EVENT_O_CPUIRQSEL16                                         0x00000040

// Output Selection for CPU Interrupt 17
#define EVENT_O_CPUIRQSEL17                                         0x00000044

// Output Selection for CPU Interrupt 18
#define EVENT_O_CPUIRQSEL18                                         0x00000048

// Output Selection for CPU Interrupt 19
#define EVENT_O_CPUIRQSEL19                                         0x0000004C

// Output Selection for CPU Interrupt 20
#define EVENT_O_CPUIRQSEL20                                         0x00000050

// Output Selection for CPU Interrupt 21
#define EVENT_O_CPUIRQSEL21                                         0x00000054

// Output Selection for CPU Interrupt 22
#define EVENT_O_CPUIRQSEL22                                         0x00000058

// Output Selection for CPU Interrupt 23
#define EVENT_O_CPUIRQSEL23                                         0x0000005C

// Output Selection for CPU Interrupt 24
#define EVENT_O_CPUIRQSEL24                                         0x00000060

// Output Selection for CPU Interrupt 25
#define EVENT_O_CPUIRQSEL25                                         0x00000064

// Output Selection for CPU Interrupt 26
#define EVENT_O_CPUIRQSEL26                                         0x00000068

// Output Selection for CPU Interrupt 27
#define EVENT_O_CPUIRQSEL27                                         0x0000006C

// Output Selection for CPU Interrupt 28
#define EVENT_O_CPUIRQSEL28                                         0x00000070

// Output Selection for CPU Interrupt 29
#define EVENT_O_CPUIRQSEL29                                         0x00000074

// Output Selection for CPU Interrupt 30
#define EVENT_O_CPUIRQSEL30                                         0x00000078

// Output Selection for CPU Interrupt 31
#define EVENT_O_CPUIRQSEL31                                         0x0000007C

// Output Selection for CPU Interrupt 32
#define EVENT_O_CPUIRQSEL32                                         0x00000080

// Output Selection for CPU Interrupt 33
#define EVENT_O_CPUIRQSEL33                                         0x00000084

// Output Selection for RFC Event 0
#define EVENT_O_RFCSEL0                                             0x00000100

