hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/rf_noRtos_lib/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_CM3NMISEL0
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// WDT_NMI                  Watchdog non maskable interrupt event, controlled
//                          by WDT:CTL.INTTYPE
#define EVENT_CM3NMISEL0_EV_W                                                7
#define EVENT_CM3NMISEL0_EV_M                                       0x0000007F
#define EVENT_CM3NMISEL0_EV_S                                                0
#define EVENT_CM3NMISEL0_EV_WDT_NMI                                 0x00000063

//*****************************************************************************
//
// Register: EVENT_O_I2SSTMPSEL0
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// RFC_IN_EV7               RFC RAT event 7, configured by RFC_RAT:RATEV.OEVT7
// RFC_IN_EV6               RFC RAT event 6, configured by RFC_RAT:RATEV.OEVT6
// RFC_IN_EV5               RFC RAT event 5, configured by RFC_RAT:RATEV.OEVT5
// RFC_IN_EV4               RFC RAT event 4, configured by RFC_RAT:RATEV.OEVT4
// NONE                     Always inactive
#define EVENT_I2SSTMPSEL0_EV_W                                               7
#define EVENT_I2SSTMPSEL0_EV_M                                      0x0000007F
#define EVENT_I2SSTMPSEL0_EV_S                                               0
#define EVENT_I2SSTMPSEL0_EV_ALWAYS_ACTIVE                          0x00000079
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV7                             0x00000062
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV6                             0x00000061
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV5                             0x00000060
#define EVENT_I2SSTMPSEL0_EV_RFC_IN_EV4                             0x0000005F
#define EVENT_I2SSTMPSEL0_EV_NONE                                   0x00000000

//*****************************************************************************
//
// Register: EVENT_O_FRZSEL0
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// CPU_HALTED               CPU halted
// NONE                     Always inactive
#define EVENT_FRZSEL0_EV_W                                                   7
#define EVENT_FRZSEL0_EV_M                                          0x0000007F
#define EVENT_FRZSEL0_EV_S                                                   0
#define EVENT_FRZSEL0_EV_ALWAYS_ACTIVE                              0x00000079
#define EVENT_FRZSEL0_EV_CPU_HALTED                                 0x00000078
#define EVENT_FRZSEL0_EV_NONE                                       0x00000000

//*****************************************************************************
//
// Register: EVENT_O_SWEV
//
//*****************************************************************************
// Field:    [24] SWEV3
//
// Writing "1" to this bit when the value is "0" triggers the Software 3 event.
#define EVENT_SWEV_SWEV3                                            0x01000000
#define EVENT_SWEV_SWEV3_BITN                                               24
#define EVENT_SWEV_SWEV3_M                                          0x01000000
#define EVENT_SWEV_SWEV3_S                                                  24

// Field:    [16] SWEV2
//
// Writing "1" to this bit when the value is "0" triggers the Software 2 event.
#define EVENT_SWEV_SWEV2                                            0x00010000
#define EVENT_SWEV_SWEV2_BITN                                               16
#define EVENT_SWEV_SWEV2_M                                          0x00010000
#define EVENT_SWEV_SWEV2_S                                                  16

// Field:     [8] SWEV1
//
// Writing "1" to this bit when the value is "0" triggers the Software 1 event.
#define EVENT_SWEV_SWEV1                                            0x00000100
#define EVENT_SWEV_SWEV1_BITN                                                8
#define EVENT_SWEV_SWEV1_M                                          0x00000100
#define EVENT_SWEV_SWEV1_S                                                   8

// Field:     [0] SWEV0
//
// Writing "1" to this bit when the value is "0" triggers the Software 0 event.
#define EVENT_SWEV_SWEV0                                            0x00000001
#define EVENT_SWEV_SWEV0_BITN                                                0
#define EVENT_SWEV_SWEV0_M                                          0x00000001
#define EVENT_SWEV_SWEV0_S                                                   0


#endif // __EVENT__
